[
	{
		"id": 1,
		"name": "Introduction to C Programming",
		"image": "https://i.ibb.co/cDQ0jg2/c.png",
		"description": "This specialization is designed to develop strong programming fundamentals for learners who want to solve complex problems by writing computer programs.",
		"credit": 4,
		"price": 11000
	},
	{
		"id": 2,
		"name": "Introduction to Algorithms",
		"image": "https://i.ibb.co/6m0Qbv1/algorithm.png",
		"description": "Introduction to Algorithms is a course that teaches mathematical modeling of computational problems, common algorithms, algorithmic paradigms, and data structures used to solve these problems.",
		"credit": 3,
		"price": 15000
	},
	{
		"id": 3,
		"name": "Introduction to C++ for DSA",
		"image": "https://i.ibb.co/85LfbP2/Rectangle-2-4.png",
		"description": "The course is designed to help you understand various data structures and algorithms, their characteristics, and how to implement them to conduct efficiency analyses in C++ from scratch.",
		"credit": 10,
		"price": 13000
	},
	{
		"id": 4,
		"name": "Basic Data Structures",
		"image": "https://i.ibb.co/k3KymMz/data-Structure.png",
		"description": "The course covers the common data structures used in various computational problems, how they are implemented in different programming languages, and how to practice implementing them in programming assignments.",
		"credit": 5,
		"price": 35000
	},
	{
		"id": 5,
		"name": "Introduction to OOP Python",
		"image": "https://i.ibb.co/Z1dQFBM/python.png",
		"description": "This course is designed to provide a basic conceptual understanding of object-oriented programming in Python. It is aimed at those who have no prior experience of object-oriented programming.",
		"credit": 4,
		"price": 19000
	},
	{
		"id": 6,
		"name": "Software Engineering",
		"image": "https://i.ibb.co/7NPXPP3/Rectangle-2-5.png",
		"description": "This course provides a foundational understanding of software development, programming, and the many exciting job roles and career paths in the IT industry.",
		"credit": 2,
		"price": 23000
	},
	{
		"id": 7,
		"name": "AWS, Cloud Computing",
		"image": "https://i.ibb.co/bb9Ym3j/aws.png",
		"description": "AWS is the most comprehensive and widely adopted cloud platform in the world, with millions of customers, including startups, enterprises, and government agencies, using it to lower costs, become more agile, and innovate faster.",
		"credit": 5,
		"price": 35000
	},
	{
		"id": 8,
		"name": "Database (MySQL)",
		"image": "https://i.ibb.co/QfJ68qz/mySql.png",
		"description": "Database (MySQL) would cover the fundamental concepts of database management systems, including data modeling, database design, normalization, and SQL programming.",
		"credit": 5,
		"price": 19000
	},
	{
		"id": 9,
		"name": "Problem-Solving Part",
		"image": "https://i.ibb.co/n07qRhs/problem.png",
		"description": "Problem-solving is the process of identifying, analyzing, and resolving problems. It involves defining the problem, determining its root cause, prioritizing and selecting potential solutions, and implementing the chosen solution.",
		"credit": 6,
		"price": 23000
	}
]
